app/controllers/api/records_controller.rb

SELECT "records".* FROM "records" WHERE (user_id = 2) ORDER BY created_at DESC
---
	def index
		@records = Record.where(["user_id = ?", @user.id]).order("created_at DESC")