app/controllers/records_controller.rb

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "152"]]
---
  def set_record_var
    @record = Record.find(params[:id])