app/controllers/records_controller.rb

SELECT "records".* FROM "records" WHERE (user_id = 1) ORDER BY created_at DESC
SELECT "records".* FROM "records" ORDER BY created_at DESC
---
  def index
		puts params[:year]
		if params[:year]
			start_date = DateTime.new(params[:year].to_i, 1, 1)
			finish_date = DateTime.new(params[:year].to_i, 12, 31)
			@records = Record.where(["created_at >= ? AND created_at <= ?", start_date, finish_date]).order("created_at DESC")
		else
			@records = Record.order("created_at DESC")

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "135"]]
---
  def edit
    @record = Record.find(params[:id])

INSERT INTO "records" ("car", "created_at", "reason", "start_lat", "start_location", "start_long", "start_odometer", "start_use_coords", "stop_lat", "stop_location", "stop_long", "stop_odometer", "stop_use_coords", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @record = Record.new(params[:record])

    respond_to do |format|
      if @record.save

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "86"]]
UPDATE "records" SET "reason" = 'Voluptas consequuntur provident consequuntur minima animi fugit veniam aperiam voluptas cum ipsum ut autem blanditiis dolorem temporibus. aut occaecati assumfdfdfdf dffenda nesciunt voluptatem explicabo quae aut sed id quia voluptates dolorum necessitatibus blanditiis voluptate voluptatem. natus laboriosam perferendis saepe ab consequatur alias sit nesciunt nesciunt molestiae voluptas aut similique dolorum. qui nihil veritatis et cupiditate magni quaerat cupiditate officia a. voluptatum voluptas aut odit enim amet autem aut qui sed ipsum et et ut
---
  def update
    @record = Record.find(params[:id])

    respond_to do |format|
      if @record.update_attributes(params[:record])

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", "151"]]
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 151]]
---
  def destroy
    @record = Record.find(params[:id])
    @record.destroy